In [1]:
"""***************************** 23rd feb'23 Assignment *****************************"""

"***************************** 23rd feb'23 Assignment *****************************"

In [6]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [20]:
"""Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series."""

import pandas as pd
series_Q1 = pd.Series([4,8,15,16,23,42])
print(series_Q1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [21]:
"""Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
        variable print it."""

import pandas as pd
ser_Q2 = [12,45,78,98,65,32,25,58,47,20]
series_Q2 = pd.Series(ser_Q2)
print(series_Q2)

0    12
1    45
2    78
3    98
4    65
5    32
6    25
7    58
8    47
9    20
dtype: int64

In [24]:
"""Q3. Create a Pandas DataFrame that contains the following data:"""

data_Q3=[["Name","Age","Gender"],
         ["Alice",25,"Female"],
         ["Bob",30,"Male"],
        ["Claire",27,"Female"]]
with open("service_2.csv",'w') as f :
    write_file = csv.writer(f)
    for i in data_Q3:
        write_file.writerow(i)

In [26]:
import pandas as pd
ser_Q3 = pd.read_csv("service_2.csv")
ser_Q3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
"""Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example."""

Ans.  
    A DataFrame in pandas is a two-dimensional data structure that represents tabular data,
    similar to a table in a spreadsheet. It consists of rows and columns, where each column
    can hold different data types. It provides a convenient way to organize, manipulate, and analyze data.
    
    DataFrame is a two-dimensional structure that contains multiple Series, while a Series is a 
    one-dimensional structure representing a single column or row of data.

In [27]:
import pandas as pd
ser_Q3 = pd.read_csv("service_2.csv")
type(ser_Q3)

pandas.core.frame.DataFrame

In [28]:
ser_Q3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
type(ser_Q3['Name'])

pandas.core.series.Series

In [30]:
ser_Q3['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [ ]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
        you give an example of when you might use one of these functions?"""

Ans.
* head() and tail(): Return the first or last n rows of the DataFrame, respectively.
* info(): Display the summary information about the DataFrame,including the column names,data types,non-null values.
* sort_values(): Sort the DataFrame by one or more columns.
* drop(): Remove specified rows or columns from the DataFrame.

In [37]:
ser_Q3.head(2) 
# top value

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [38]:
ser_Q3.tail(1)
# below value

     Name  Age  Gender
2  Claire   27  Female

In [39]:
ser_Q3.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [44]:
ser_Q3.drop(['Name'], axis=1)

   Age  Gender
0   25  Female
1   30    Male
2   27  Female